Revit 2026 API

# TransactWithCentralOptions Methods

---

The TransactWithCentralOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLockCallback | Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetLockCallback | Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TransactWithCentralOptions Class

Autodesk.Revit.DB Namespace